<template>
    <div class="beauty">
        <h3 class="public_title">#BEAUTY</h3>
        <div v-for="item in beautyData.beautyList" :key="item.id" class="public_flex scrollTop active">
            <div class="img">
                <router-link :to="`/${item.href}/${item.id}`">  
                <!-- <a :href="item.href"> -->
                    <!-- <img :src="require(`@/assets/${item.src}`)" class="img-responsive"> -->
                    <!-- public -->
                    <img :src="item.src" class="img-responsive">
                <!-- </a> -->
                </router-link>  
                <div class="date">
                    <span class="num">{{item.data_num}}</span>
                    <span class="month">{{item.data_month}}</span>
                    <span class="year">{{item.data_year}}</span>
                </div>
            </div>
            <div class="texts">
                <div class="title">
                    <a :href="item.href" title="">{{item.title}}</a>
                </div>
                <div class="share">
                    <div class="share_text">
                        <svg viewBox="0 0 30 30">
                            <path d="M 23 3 A 4 4 0 0 0 19 7 A 4 4 0 0 0 19.09375 7.8359375 L 10.011719 12.376953 A 4 4 0 0 0 7 11 A 4 4 0 0 0 3 15 A 4 4 0 0 0 7 19 A 4 4 0 0 0 10.013672 17.625 L 19.089844 22.164062 A 4 4 0 0 0 19 23 A 4 4 0 0 0 23 27 A 4 4 0 0 0 27 23 A 4 4 0 0 0 23 19 A 4 4 0 0 0 19.986328 20.375 L 10.910156 15.835938 A 4 4 0 0 0 11 15 A 4 4 0 0 0 10.90625 14.166016 L 19.988281 9.625 A 4 4 0 0 0 23 11 A 4 4 0 0 0 27 7 A 4 4 0 0 0 23 3 z"/>
                        </svg>
                        <p>share</p>
                    </div>
                    <div class="share_link">
                        <a :href="item.hrefFb" title="分享至facebook">
                            <svg viewBox="0 0 24 24">
                                <path d="M 19 3 L 5 3 C 3.894531 3 3 3.894531 3 5 L 3 19 C 3 20.105469 3.894531 21 5 21 L 12.621094 21 L 12.621094 14.039062 L 10.277344 14.039062 L 10.277344 11.3125 L 12.621094 11.3125 L 12.621094 9.308594 C 12.621094 6.984375 14.042969 5.71875 16.117188 5.71875 C 16.816406 5.714844 17.511719 5.753906 18.207031 5.824219 L 18.207031 8.253906 L 16.78125 8.253906 C 15.648438 8.253906 15.429688 8.785156 15.429688 9.574219 L 15.429688 11.308594 L 18.128906 11.308594 L 17.777344 14.035156 L 15.414062 14.035156 L 15.414062 21 L 19 21 C 20.105469 21 21 20.105469 21 19 L 21 5 C 21 3.894531 20.105469 3 19 3 Z M 19 3 "/>
                            </svg>
                        </a>
                        <a :href="item.hrefLine" title="分享至Line">
                            <svg viewBox="0 0 48 48">
                                <path d="M25.12,44.521c-2.114,1.162-2.024-0.549-1.933-1.076c0.054-0.314,0.3-1.787,0.3-1.787c0.07-0.534,0.144-1.36-0.067-1.887 c-0.235-0.58-1.166-0.882-1.85-1.029C11.48,37.415,4.011,30.4,4.011,22.025c0-9.342,9.42-16.943,20.995-16.943S46,12.683,46,22.025 C46,32.517,34.872,39.159,25.12,44.521z M18.369,25.845c0-0.56-0.459-1.015-1.023-1.015h-2.856v-6.678 c0-0.56-0.459-1.015-1.023-1.015c-0.565,0-1.023,0.455-1.023,1.015v7.694c0,0.561,0.459,1.016,1.023,1.016h3.879 C17.91,26.863,18.369,26.406,18.369,25.845z M21.357,18.152c0-0.56-0.459-1.015-1.023-1.015c-0.565,0-1.023,0.455-1.023,1.015 v7.694c0,0.561,0.459,1.016,1.023,1.016c0.565,0,1.023-0.456,1.023-1.016V18.152z M30.697,18.152c0-0.56-0.459-1.015-1.023-1.015 c-0.565,0-1.025,0.455-1.025,1.015v4.761l-3.978-5.369c-0.192-0.254-0.499-0.406-0.818-0.406c-0.11,0-0.219,0.016-0.325,0.052 c-0.419,0.139-0.7,0.526-0.7,0.963v7.694c0,0.561,0.46,1.016,1.025,1.016c0.566,0,1.025-0.456,1.025-1.016v-4.759l3.976,5.369 c0.192,0.254,0.498,0.406,0.818,0.406c0.109,0,0.219-0.018,0.325-0.053c0.42-0.137,0.7-0.524,0.7-0.963V18.152z M36.975,20.984 h-2.856v-1.817h2.856c0.566,0,1.025-0.455,1.025-1.015c0-0.56-0.46-1.015-1.025-1.015h-3.879c-0.565,0-1.023,0.455-1.023,1.015 c0,0.001,0,0.001,0,0.003v3.842v0.001c0,0,0,0,0,0.001v3.845c0,0.561,0.46,1.016,1.023,1.016h3.879 c0.565,0,1.025-0.456,1.025-1.016c0-0.56-0.46-1.015-1.025-1.015h-2.856v-1.817h2.856c0.566,0,1.025-0.455,1.025-1.015 c0-0.561-0.46-1.016-1.025-1.016V20.984z"/>
                            </svg>
                        </a>
                        <a :href="item.hrefIg" title="分享至Instagram">
                            <svg viewBox="0 0 24 24">    
                                <path d="M 8 3 C 5.239 3 3 5.239 3 8 L 3 16 C 3 18.761 5.239 21 8 21 L 16 21 C 18.761 21 21 18.761 21 16 L 21 8 C 21 5.239 18.761 3 16 3 L 8 3 z M 18 5 C 18.552 5 19 5.448 19 6 C 19 6.552 18.552 7 18 7 C 17.448 7 17 6.552 17 6 C 17 5.448 17.448 5 18 5 z M 12 7 C 14.761 7 17 9.239 17 12 C 17 14.761 14.761 17 12 17 C 9.239 17 7 14.761 7 12 C 7 9.239 9.239 7 12 7 z M 12 9 A 3 3 0 0 0 9 12 A 3 3 0 0 0 12 15 A 3 3 0 0 0 15 12 A 3 3 0 0 0 12 9 z"/>
                            </svg>
                        </a>
                    </div>
                </div>
                <div class="text">
                    <p>{{item.text}}</p>
                    <router-link :to="`/${item.href}/${item.id}`" title="查看全文">  
                        <!-- <a :href="item.href" title="查看全文"> -->
                        READ MORE
                        <!-- </a> -->
                    </router-link>  
                </div>
            </div>
        </div>
        <!-- <div class="public_flex scrollTop">
            <div class="img">
                <a href="new_view.html">
                    <img src="@/assets/ti02.jpg" class="img-responsive">
                </a>
                <div class="date">
                    <span class="num">17</span>
                    <span class="month">APR</span>
                    <span class="year">2017</span>
                </div>
            </div>
            <div class="texts">
                <div class="title">
                    <a href="new_view.html" title="">【美妝】來自泰國的超濃黑眼線─Mistine Maxi Black</a>
                </div>
                <div class="share">
                    <div class="share_text">
                        <svg viewBox="0 0 30 30">
                            <path d="M 23 3 A 4 4 0 0 0 19 7 A 4 4 0 0 0 19.09375 7.8359375 L 10.011719 12.376953 A 4 4 0 0 0 7 11 A 4 4 0 0 0 3 15 A 4 4 0 0 0 7 19 A 4 4 0 0 0 10.013672 17.625 L 19.089844 22.164062 A 4 4 0 0 0 19 23 A 4 4 0 0 0 23 27 A 4 4 0 0 0 27 23 A 4 4 0 0 0 23 19 A 4 4 0 0 0 19.986328 20.375 L 10.910156 15.835938 A 4 4 0 0 0 11 15 A 4 4 0 0 0 10.90625 14.166016 L 19.988281 9.625 A 4 4 0 0 0 23 11 A 4 4 0 0 0 27 7 A 4 4 0 0 0 23 3 z"/>
                        </svg>
                        <p>share</p>
                    </div>
                    <div class="share_link">
                        <a href="" title="分享至facebook">
                            <svg viewBox="0 0 24 24">
                                <path d="M 19 3 L 5 3 C 3.894531 3 3 3.894531 3 5 L 3 19 C 3 20.105469 3.894531 21 5 21 L 12.621094 21 L 12.621094 14.039062 L 10.277344 14.039062 L 10.277344 11.3125 L 12.621094 11.3125 L 12.621094 9.308594 C 12.621094 6.984375 14.042969 5.71875 16.117188 5.71875 C 16.816406 5.714844 17.511719 5.753906 18.207031 5.824219 L 18.207031 8.253906 L 16.78125 8.253906 C 15.648438 8.253906 15.429688 8.785156 15.429688 9.574219 L 15.429688 11.308594 L 18.128906 11.308594 L 17.777344 14.035156 L 15.414062 14.035156 L 15.414062 21 L 19 21 C 20.105469 21 21 20.105469 21 19 L 21 5 C 21 3.894531 20.105469 3 19 3 Z M 19 3 "/>
                            </svg>
                        </a>
                        <a href="" title="分享至Line">
                            <svg viewBox="0 0 48 48">
                                <path d="M25.12,44.521c-2.114,1.162-2.024-0.549-1.933-1.076c0.054-0.314,0.3-1.787,0.3-1.787c0.07-0.534,0.144-1.36-0.067-1.887 c-0.235-0.58-1.166-0.882-1.85-1.029C11.48,37.415,4.011,30.4,4.011,22.025c0-9.342,9.42-16.943,20.995-16.943S46,12.683,46,22.025 C46,32.517,34.872,39.159,25.12,44.521z M18.369,25.845c0-0.56-0.459-1.015-1.023-1.015h-2.856v-6.678 c0-0.56-0.459-1.015-1.023-1.015c-0.565,0-1.023,0.455-1.023,1.015v7.694c0,0.561,0.459,1.016,1.023,1.016h3.879 C17.91,26.863,18.369,26.406,18.369,25.845z M21.357,18.152c0-0.56-0.459-1.015-1.023-1.015c-0.565,0-1.023,0.455-1.023,1.015 v7.694c0,0.561,0.459,1.016,1.023,1.016c0.565,0,1.023-0.456,1.023-1.016V18.152z M30.697,18.152c0-0.56-0.459-1.015-1.023-1.015 c-0.565,0-1.025,0.455-1.025,1.015v4.761l-3.978-5.369c-0.192-0.254-0.499-0.406-0.818-0.406c-0.11,0-0.219,0.016-0.325,0.052 c-0.419,0.139-0.7,0.526-0.7,0.963v7.694c0,0.561,0.46,1.016,1.025,1.016c0.566,0,1.025-0.456,1.025-1.016v-4.759l3.976,5.369 c0.192,0.254,0.498,0.406,0.818,0.406c0.109,0,0.219-0.018,0.325-0.053c0.42-0.137,0.7-0.524,0.7-0.963V18.152z M36.975,20.984 h-2.856v-1.817h2.856c0.566,0,1.025-0.455,1.025-1.015c0-0.56-0.46-1.015-1.025-1.015h-3.879c-0.565,0-1.023,0.455-1.023,1.015 c0,0.001,0,0.001,0,0.003v3.842v0.001c0,0,0,0,0,0.001v3.845c0,0.561,0.46,1.016,1.023,1.016h3.879 c0.565,0,1.025-0.456,1.025-1.016c0-0.56-0.46-1.015-1.025-1.015h-2.856v-1.817h2.856c0.566,0,1.025-0.455,1.025-1.015 c0-0.561-0.46-1.016-1.025-1.016V20.984z"/>
                            </svg>
                        </a>
                        <a href="" title="分享至Instagram">
                            <svg viewBox="0 0 24 24">    
                                <path d="M 8 3 C 5.239 3 3 5.239 3 8 L 3 16 C 3 18.761 5.239 21 8 21 L 16 21 C 18.761 21 21 18.761 21 16 L 21 8 C 21 5.239 18.761 3 16 3 L 8 3 z M 18 5 C 18.552 5 19 5.448 19 6 C 19 6.552 18.552 7 18 7 C 17.448 7 17 6.552 17 6 C 17 5.448 17.448 5 18 5 z M 12 7 C 14.761 7 17 9.239 17 12 C 17 14.761 14.761 17 12 17 C 9.239 17 7 14.761 7 12 C 7 9.239 9.239 7 12 7 z M 12 9 A 3 3 0 0 0 9 12 A 3 3 0 0 0 12 15 A 3 3 0 0 0 15 12 A 3 3 0 0 0 12 9 z"/>
                            </svg>
                        </a>
                    </div>
                </div>
                <div class="text">
                    <p>來自泰國知名彩妝品牌Mistine，是每次使用必被詢問的眉筆！大家喜歡的原因是它的亞麻色調，加上它一組有眉筆、眉粉與染眉膏三個套件，先使用眉筆畫眉，接著以眉粉暈染創造自然眉型，再用染眉膏調整眉色。</p>
                    <p>這隻眼線液的防水持妝效果也是我目前用過最好的， 成功打拜我心中的NO1 Kiss Me，所以幫大家做了防水測試！ 防水效果達到了平常是眼線蠟筆才有的等級， 沖水不掉之外，連用手擦拭都不會掉！ 直接把水珠吸乾可以發現，眼線沒有受到半分的影響喔。</p>
                    <a href="new_view.html" title="查看全文">READ MORE</a>
                </div>
            </div>
        </div>
        <div class="public_flex scrollTop">
            <div class="img">
                <a href="new_view.html">
                    <img src="@/assets/ti03.jpg" class="img-responsive">
                </a>
                <div class="date">
                    <span class="num">17</span>
                    <span class="month">APR</span>
                    <span class="year">2017</span>
                </div>
            </div>
            <div class="texts">
                <div class="title">
                    <a href="new_view.html" title="">【美妝】來自泰國的超濃黑眼線─Mistine Maxi Black</a>
                </div>
                <div class="share">
                    <div class="share_text">
                        <svg viewBox="0 0 30 30">
                            <path d="M 23 3 A 4 4 0 0 0 19 7 A 4 4 0 0 0 19.09375 7.8359375 L 10.011719 12.376953 A 4 4 0 0 0 7 11 A 4 4 0 0 0 3 15 A 4 4 0 0 0 7 19 A 4 4 0 0 0 10.013672 17.625 L 19.089844 22.164062 A 4 4 0 0 0 19 23 A 4 4 0 0 0 23 27 A 4 4 0 0 0 27 23 A 4 4 0 0 0 23 19 A 4 4 0 0 0 19.986328 20.375 L 10.910156 15.835938 A 4 4 0 0 0 11 15 A 4 4 0 0 0 10.90625 14.166016 L 19.988281 9.625 A 4 4 0 0 0 23 11 A 4 4 0 0 0 27 7 A 4 4 0 0 0 23 3 z"/>
                        </svg>
                        <p>share</p>
                    </div>
                    <div class="share_link">
                        <a href="" title="分享至facebook">
                            <svg viewBox="0 0 24 24">
                                <path d="M 19 3 L 5 3 C 3.894531 3 3 3.894531 3 5 L 3 19 C 3 20.105469 3.894531 21 5 21 L 12.621094 21 L 12.621094 14.039062 L 10.277344 14.039062 L 10.277344 11.3125 L 12.621094 11.3125 L 12.621094 9.308594 C 12.621094 6.984375 14.042969 5.71875 16.117188 5.71875 C 16.816406 5.714844 17.511719 5.753906 18.207031 5.824219 L 18.207031 8.253906 L 16.78125 8.253906 C 15.648438 8.253906 15.429688 8.785156 15.429688 9.574219 L 15.429688 11.308594 L 18.128906 11.308594 L 17.777344 14.035156 L 15.414062 14.035156 L 15.414062 21 L 19 21 C 20.105469 21 21 20.105469 21 19 L 21 5 C 21 3.894531 20.105469 3 19 3 Z M 19 3 "/>
                            </svg>
                        </a>
                        <a href="" title="分享至Line">
                            <svg viewBox="0 0 48 48">
                                <path d="M25.12,44.521c-2.114,1.162-2.024-0.549-1.933-1.076c0.054-0.314,0.3-1.787,0.3-1.787c0.07-0.534,0.144-1.36-0.067-1.887 c-0.235-0.58-1.166-0.882-1.85-1.029C11.48,37.415,4.011,30.4,4.011,22.025c0-9.342,9.42-16.943,20.995-16.943S46,12.683,46,22.025 C46,32.517,34.872,39.159,25.12,44.521z M18.369,25.845c0-0.56-0.459-1.015-1.023-1.015h-2.856v-6.678 c0-0.56-0.459-1.015-1.023-1.015c-0.565,0-1.023,0.455-1.023,1.015v7.694c0,0.561,0.459,1.016,1.023,1.016h3.879 C17.91,26.863,18.369,26.406,18.369,25.845z M21.357,18.152c0-0.56-0.459-1.015-1.023-1.015c-0.565,0-1.023,0.455-1.023,1.015 v7.694c0,0.561,0.459,1.016,1.023,1.016c0.565,0,1.023-0.456,1.023-1.016V18.152z M30.697,18.152c0-0.56-0.459-1.015-1.023-1.015 c-0.565,0-1.025,0.455-1.025,1.015v4.761l-3.978-5.369c-0.192-0.254-0.499-0.406-0.818-0.406c-0.11,0-0.219,0.016-0.325,0.052 c-0.419,0.139-0.7,0.526-0.7,0.963v7.694c0,0.561,0.46,1.016,1.025,1.016c0.566,0,1.025-0.456,1.025-1.016v-4.759l3.976,5.369 c0.192,0.254,0.498,0.406,0.818,0.406c0.109,0,0.219-0.018,0.325-0.053c0.42-0.137,0.7-0.524,0.7-0.963V18.152z M36.975,20.984 h-2.856v-1.817h2.856c0.566,0,1.025-0.455,1.025-1.015c0-0.56-0.46-1.015-1.025-1.015h-3.879c-0.565,0-1.023,0.455-1.023,1.015 c0,0.001,0,0.001,0,0.003v3.842v0.001c0,0,0,0,0,0.001v3.845c0,0.561,0.46,1.016,1.023,1.016h3.879 c0.565,0,1.025-0.456,1.025-1.016c0-0.56-0.46-1.015-1.025-1.015h-2.856v-1.817h2.856c0.566,0,1.025-0.455,1.025-1.015 c0-0.561-0.46-1.016-1.025-1.016V20.984z"/>
                            </svg>
                        </a>
                        <a href="" title="分享至Instagram">
                            <svg viewBox="0 0 24 24">    
                                <path d="M 8 3 C 5.239 3 3 5.239 3 8 L 3 16 C 3 18.761 5.239 21 8 21 L 16 21 C 18.761 21 21 18.761 21 16 L 21 8 C 21 5.239 18.761 3 16 3 L 8 3 z M 18 5 C 18.552 5 19 5.448 19 6 C 19 6.552 18.552 7 18 7 C 17.448 7 17 6.552 17 6 C 17 5.448 17.448 5 18 5 z M 12 7 C 14.761 7 17 9.239 17 12 C 17 14.761 14.761 17 12 17 C 9.239 17 7 14.761 7 12 C 7 9.239 9.239 7 12 7 z M 12 9 A 3 3 0 0 0 9 12 A 3 3 0 0 0 12 15 A 3 3 0 0 0 15 12 A 3 3 0 0 0 12 9 z"/>
                            </svg>
                        </a>
                    </div>
                </div>
                <div class="text">
                    <p>來自泰國知名彩妝品牌Mistine，是每次使用必被詢問的眉筆！大家喜歡的原因是它的亞麻色調，加上它一組有眉筆、眉粉與染眉膏三個套件，先使用眉筆畫眉，接著以眉粉暈染創造自然眉型，再用染眉膏調整眉色。</p>
                    <p>這隻眼線液的防水持妝效果也是我目前用過最好的， 成功打拜我心中的NO1 Kiss Me，所以幫大家做了防水測試！ 防水效果達到了平常是眼線蠟筆才有的等級， 沖水不掉之外，連用手擦拭都不會掉！ 直接把水珠吸乾可以發現，眼線沒有受到半分的影響喔。</p>
                    <a href="new_view.html" title="查看全文">READ MORE</a>
                </div>
            </div>
        </div>
        <div class="public_flex scrollTop">
            <div class="img">
                <a href="new_view.html">
                    <img src="@/assets/ti01.jpg" class="img-responsive">
                </a>
                <div class="date">
                    <span class="num">17</span>
                    <span class="month">APR</span>
                    <span class="year">2017</span>
                </div>
            </div>
            <div class="texts">
                <div class="title">
                    <a href="new_view.html" title="">【美妝】來自泰國的超濃黑眼線─Mistine Maxi Black</a>
                </div>
                <div class="share">
                    <div class="share_text">
                        <svg viewBox="0 0 30 30">
                            <path d="M 23 3 A 4 4 0 0 0 19 7 A 4 4 0 0 0 19.09375 7.8359375 L 10.011719 12.376953 A 4 4 0 0 0 7 11 A 4 4 0 0 0 3 15 A 4 4 0 0 0 7 19 A 4 4 0 0 0 10.013672 17.625 L 19.089844 22.164062 A 4 4 0 0 0 19 23 A 4 4 0 0 0 23 27 A 4 4 0 0 0 27 23 A 4 4 0 0 0 23 19 A 4 4 0 0 0 19.986328 20.375 L 10.910156 15.835938 A 4 4 0 0 0 11 15 A 4 4 0 0 0 10.90625 14.166016 L 19.988281 9.625 A 4 4 0 0 0 23 11 A 4 4 0 0 0 27 7 A 4 4 0 0 0 23 3 z"/>
                        </svg>
                        <p>share</p>
                    </div>
                    <div class="share_link">
                        <a href="" title="分享至facebook">
                            <svg viewBox="0 0 24 24">
                                <path d="M 19 3 L 5 3 C 3.894531 3 3 3.894531 3 5 L 3 19 C 3 20.105469 3.894531 21 5 21 L 12.621094 21 L 12.621094 14.039062 L 10.277344 14.039062 L 10.277344 11.3125 L 12.621094 11.3125 L 12.621094 9.308594 C 12.621094 6.984375 14.042969 5.71875 16.117188 5.71875 C 16.816406 5.714844 17.511719 5.753906 18.207031 5.824219 L 18.207031 8.253906 L 16.78125 8.253906 C 15.648438 8.253906 15.429688 8.785156 15.429688 9.574219 L 15.429688 11.308594 L 18.128906 11.308594 L 17.777344 14.035156 L 15.414062 14.035156 L 15.414062 21 L 19 21 C 20.105469 21 21 20.105469 21 19 L 21 5 C 21 3.894531 20.105469 3 19 3 Z M 19 3 "/>
                            </svg>
                        </a>
                        <a href="" title="分享至Line">
                            <svg viewBox="0 0 48 48">
                                <path d="M25.12,44.521c-2.114,1.162-2.024-0.549-1.933-1.076c0.054-0.314,0.3-1.787,0.3-1.787c0.07-0.534,0.144-1.36-0.067-1.887 c-0.235-0.58-1.166-0.882-1.85-1.029C11.48,37.415,4.011,30.4,4.011,22.025c0-9.342,9.42-16.943,20.995-16.943S46,12.683,46,22.025 C46,32.517,34.872,39.159,25.12,44.521z M18.369,25.845c0-0.56-0.459-1.015-1.023-1.015h-2.856v-6.678 c0-0.56-0.459-1.015-1.023-1.015c-0.565,0-1.023,0.455-1.023,1.015v7.694c0,0.561,0.459,1.016,1.023,1.016h3.879 C17.91,26.863,18.369,26.406,18.369,25.845z M21.357,18.152c0-0.56-0.459-1.015-1.023-1.015c-0.565,0-1.023,0.455-1.023,1.015 v7.694c0,0.561,0.459,1.016,1.023,1.016c0.565,0,1.023-0.456,1.023-1.016V18.152z M30.697,18.152c0-0.56-0.459-1.015-1.023-1.015 c-0.565,0-1.025,0.455-1.025,1.015v4.761l-3.978-5.369c-0.192-0.254-0.499-0.406-0.818-0.406c-0.11,0-0.219,0.016-0.325,0.052 c-0.419,0.139-0.7,0.526-0.7,0.963v7.694c0,0.561,0.46,1.016,1.025,1.016c0.566,0,1.025-0.456,1.025-1.016v-4.759l3.976,5.369 c0.192,0.254,0.498,0.406,0.818,0.406c0.109,0,0.219-0.018,0.325-0.053c0.42-0.137,0.7-0.524,0.7-0.963V18.152z M36.975,20.984 h-2.856v-1.817h2.856c0.566,0,1.025-0.455,1.025-1.015c0-0.56-0.46-1.015-1.025-1.015h-3.879c-0.565,0-1.023,0.455-1.023,1.015 c0,0.001,0,0.001,0,0.003v3.842v0.001c0,0,0,0,0,0.001v3.845c0,0.561,0.46,1.016,1.023,1.016h3.879 c0.565,0,1.025-0.456,1.025-1.016c0-0.56-0.46-1.015-1.025-1.015h-2.856v-1.817h2.856c0.566,0,1.025-0.455,1.025-1.015 c0-0.561-0.46-1.016-1.025-1.016V20.984z"/>
                            </svg>
                        </a>
                        <a href="" title="分享至Instagram">
                            <svg viewBox="0 0 24 24">    
                                <path d="M 8 3 C 5.239 3 3 5.239 3 8 L 3 16 C 3 18.761 5.239 21 8 21 L 16 21 C 18.761 21 21 18.761 21 16 L 21 8 C 21 5.239 18.761 3 16 3 L 8 3 z M 18 5 C 18.552 5 19 5.448 19 6 C 19 6.552 18.552 7 18 7 C 17.448 7 17 6.552 17 6 C 17 5.448 17.448 5 18 5 z M 12 7 C 14.761 7 17 9.239 17 12 C 17 14.761 14.761 17 12 17 C 9.239 17 7 14.761 7 12 C 7 9.239 9.239 7 12 7 z M 12 9 A 3 3 0 0 0 9 12 A 3 3 0 0 0 12 15 A 3 3 0 0 0 15 12 A 3 3 0 0 0 12 9 z"/>
                            </svg>
                        </a>
                    </div>
                </div>
                <div class="text">
                    <p>來自泰國知名彩妝品牌Mistine，是每次使用必被詢問的眉筆！大家喜歡的原因是它的亞麻色調，加上它一組有眉筆、眉粉與染眉膏三個套件，先使用眉筆畫眉，接著以眉粉暈染創造自然眉型，再用染眉膏調整眉色。</p>
                    <p>這隻眼線液的防水持妝效果也是我目前用過最好的， 成功打拜我心中的NO1 Kiss Me，所以幫大家做了防水測試！ 防水效果達到了平常是眼線蠟筆才有的等級， 沖水不掉之外，連用手擦拭都不會掉！ 直接把水珠吸乾可以發現，眼線沒有受到半分的影響喔。</p>
                    <a href="new_view.html" title="查看全文">READ MORE</a>
                </div>
            </div>
        </div> -->
        <!-- <FnPagers></FnPagers> -->
        <FnPagers 
            v-if="beautyData.total > customParams.pageSize"
            :pageNo="customParams.pageNo" 
            :pageSize="customParams.pageSize" 
            :continues='customParams.continues' 
            :total='beautyData.total'
            @pageNo="getPageNo">
        </FnPagers>
    </div>
</template>

<script>
    import FnPagers from '@/components/FnPagers'
    export default {
        name: 'beauty',
        components: {
            FnPagers,
        },
        data() {
            return {
                customParams: {
                    continues: 5, //頁碼顯示
                    pageNo: 1, //當前頁
                    pageSize: 4, //顯示數量
                }
            }
        },
        beforeMount() {
            this.getData()
        },
        computed: {
            beautyData() {
                return this.$store.state.beauty.beautyData
            },
        },
        methods: {
            getData(){
                Object.assign(this.customParams, this.$route.query, this.$route.params)
                this.$store.dispatch('beauty/beautyAc', this.customParams)
            },
            getPageNo(pageNo){
                this.$router.push({
                    name: 'beauty',
                    query: {
                        pageNo: pageNo, //類id
                    }
                })
            }
        },
        watch: {
            //監聽路由改變執行product
            $route(newValue, oldValue) {
                this.getData()
            }
        }
    }
</script>
<style scoped>
    .beauty .public_title {
        margin-bottom: 0;
    }
    
    .beauty .public_flex {
        padding: 50px 0;
        justify-content: space-between;
    }
    
    .beauty .pagers,
    .beauty .public_flex+.public_flex {
        border-top: 1px solid #ddd;
    }
    
    .beauty .pagers {
        padding-top: 40px;
        padding-bottom: 0;
    }
    
    .beauty .img {
        position: relative;
        padding-left: 85px;
        width: 49%;
    }
    
    .beauty .img:before {
        background: #c1894c;
        width: 100%;
        width: 0;
        transition: width 0.6s 0.2s;
        content: "";
        position: absolute;
        left: 0;
        top: 0;
        bottom: 0;
        right: 0;
        pointer-events: none;
    }
    
    .beauty .scrollTop.active .img:before {
        width: 0;
    }
    
    .beauty .date {
        position: absolute;
        top: 30px;
        left: 0;
        font-family: "PTSerif-Regular";
        color: #000;
        border: 1px solid #000;
        display: block;
        width: 120px;
        padding: 15px 20px;
        position: absolute;
        z-index: 2;
        font-weight: normal;
    }
    
    .beauty .date>span {
        display: inline-block;
        vertical-align: top;
    }
    
    .beauty .date .num {
        font-size: 2.5rem;
        float: left;
        line-height: 40px;
    }
    
    .beauty .date .month {
        margin: 0;
        margin-top: 5px;
        font-size: 1rem;
    }
    
    .beauty .date .year {
        margin: 0;
        font-size: 0.8rem;
        line-height: 15px;
    }
    
    .beauty .texts {
        width: 49%;
    }
    
    .beauty .title a {
        color: #000;
        font-size: 24px;
        margin: 0 0 20px;
    }
    
    .beauty .title a:hover {
        text-decoration: underline;
    }
    
    .beauty .share {
        margin-bottom: 20px;
    }
    
    .beauty .share,
    .beauty .share_link,
    .beauty .share_text {
        display: flex;
        align-items: center;
    }
    
    .beauty .share svg {
        width: 24px;
        height: auto;
    }
    
    .beauty .share_text p {
        font-family: "Oswald-Light";
        text-transform: uppercase;
        font-size: 0.85rem;
        display: inline-block;
        margin-left: 10px;
        color: #666;
    }
    
    .beauty .share_text:after {
        content: "";
        width: 10px;
        height: 1px;
        background: #000;
        margin: 5px 10px;
        display: inline-block;
        vertical-align: middle;
    }
    
    .beauty .share_link a {
        font-size: 0;
    }
    
    .beauty .share_link a+a {
        margin-left: 5px;
    }
    
    .beauty .share_link svg {
        width: 26px;
        fill: #ddd;
    }
    
    .beauty .share_link a:hover svg {
        fill: #000;
    }
    
    .beauty .text p {
        line-height: 1.6;
        font-size: 14px;
        color: #666;
    }
    
    .beauty .text p+p {
        margin-top: 10px;
    }
    
    .beauty .text a {
        font-family: "PTSerif-Regular";
        font-size: 1rem;
        margin-top: 30px;
        padding-right: 15px;
        color: #000;
        display: inline-block;
        position: relative;
        -moz-transition: ease 0.5s;
        -o-transition: ease 0.5s;
        -webkit-transition: ease 0.5s;
        transition: ease 0.5s;
    }
    
    .beauty .text a:before {
        content: "";
        width: 8px;
        height: 1px;
        top: 50%;
        position: absolute;
        opacity: 0;
        background: #000;
    }
    
    .beauty .text a:hover {
        color: #c1894c;
    }
    
    .beauty .text a:hover:before {
        animation: liner 0.5s 0.2s ease both;
    }
    
    @keyframes liner {
        from {
            transform-origin: 0 10%;
            transform: scaleX(0);
        }
        50% {
            opacity: 1;
            transform-origin: 0 10%;
            transform: scaleX(10);
        }
        to {
            opacity: 1;
            transform-origin: 0 10%;
            transform: scaleX(1) translateX(100px);
        }
    }
</style>